Revit 2024 API
PipeFittingAndAccessoryConnectorData.Diameter Property
 The connector diameter, Units:(ft).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double Diameter { get; }
Visual Basic
Public ReadOnly Property Diameter As Double
	Get
Visual C++
public:
property double Diameter {
	double get ();
}
See Also
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace